'use client';
import styles from './privacy.module.scss';

const PrivacyPolicy = () => {
  return (
    <div className={styles.container}>
      <h1 className={styles.title}>Политика конфиденциальности</h1>

      <section className={styles.section}>
        <p className={styles.paragraph}>
          1. ООО «Экосистема Альфа» (далее - «Общество») осуществляет и
          организует обработку персональных данных различных категорий субъектов
          персональных данных при осуществлении своей основной деятельности. Для
          обработки персональных данных, полученных посредством сайта «A-JOB.RU»
          Общество привлекает на договорной основе лиц, осуществляющих
          администрирование и иное обслуживание сайта, включая ведение
          редакционно-издательской деятельности, формирование, обслуживание и
          эксплуатацию баз данных, а также реализацию различных сервисов
          посредством сайта «A-JOB.RU».
        </p>

        <p className={styles.paragraph}>
          2. При организации и осуществлении обработки персональных данных
          Общество руководствуется требованиями Федерального закона от
          27.07.2006 № 152-ФЗ «О персональных данных» и принятыми в соответствии
          с ним иными нормативными правовыми актами.
        </p>

        <p className={styles.paragraph}>
          3. Для целей настоящей Политики сайта «A-JOB.RU» под персональными
          данными понимается любая информация, предоставленная через сайт
          «A-JOB.RU» и (или) собранная с использованием поименованного сайта,
          относящаяся прямо или косвенно к определенному или определяемому
          физическому лицу (субъекту персональных данных).
        </p>

        <p className={styles.paragraph}>
          4. Сбор персональных данных осуществляется Обществом при
          предоставлении данных непосредственно пользователями через заполнение
          полей сайта «A-JOB.RU» по специально разработанным и применяемым
          уникальным критериям в момент регистрации на сайте личного кабинета
          пользователя, в момент заполнения карточки вакансии и/или карточки
          резюме. Если иное не предусмотрено конкретным сервисом, обязательными
          к предоставлению являются: имя и контактные данные в виде телефона или
          адреса электронной почты, регион проживания. Остальные данные
          предоставляются по усмотрению пользователя. Персональные данные в
          личном кабинете работодателя – юридического лица используются для
          идентификации этого юридического лица. При этом пользователь
          гарантирует достоверность предоставляемых данных, а также
          самостоятельно несет риски, связанные со снижением
          конкурентоспособности резюме и/или вакансии из-за
          недостаточности/неполноты предоставленных персональных данных.
          Предоставление биометрических данных запрещено. Запрещается
          предоставление чужих персональных данных, за исключением случаев,
          предусмотренных действующим законодательством. Размещая свои
          персональные данные при формировании личного кабинета (регистрации),
          создании вакансии/резюме на сайте «A-JOB.RU», пользователь, выражая
          свою безусловную волю, делает размещаемые персональные данные
          доступными другим пользователям (общедоступность) и самостоятельно
          несет риски, связанные с размещением персональных данных. Общество
          обязуется не использовать персональные данные способами и в целях, не
          указанных в настоящей политике, и предоставляет к ним доступ в
          соответствии с условиями соглашений сайта «A-JOB.RU». Использование
          лицами, получившими доступ к персональным данным пользователей, в
          целях, отличных от целей, связанных с трудоустройством и поиском
          сотрудников (подбора персонала, заполнения вакансий,
          поиска/предложения работы), или иных целей, определенных конкретным
          сервисом сайта «A-JOB.RU», запрещается. Использование лицами,
          получившими доступ к персональным данным пользователей, осуществляется
          с соблюдением конфиденциальности персональных данных и обеспечения
          безопасности при их обработке. Лица, получившие доступ к персональным
          данным, обязаны не раскрывать третьим лицам и не распространять
          персональные данные без согласия субъекта персональных данных, если
          иное не предусмотрено федеральным законом. При этом Общество не может
          нести ответственность за сохранение их конфиденциальности и/или за
          несанкционированное использование третьими лицами.
        </p>

        <p className={styles.paragraph}>
          5. Сайт «A-JOB.RU» может собирать информацию о действиях пользователей
          без информации о них самих (обезличенные данные), например, с помощью
          файлов cookies. При этом идентификация полученной информации с
          конкретным субъектом персональных данных Обществом не проводится.
          Политика в отношении файлов Cookies расположена в блоке «Cookies».
        </p>

        <p className={styles.paragraph}>
          6. Обработка персональных данных Обществом и привлеченными им лицами
          осуществляется в соответствии с действующим законодательством в целях
          обеспечения пользователям доступа к сервисам сайта «A-JOB.RU»,
          формирования данных о потребностях в трудовых ресурсах и предложениях
          персонала, в том числе формирования баз данных вакансий и резюме,
          организации доступа к ним и иного их использования, и содействия тем
          самым в трудоустройстве и подборе персонала, в статистических целях, в
          целях рассылок сайта «A-JOB.RU» информационного характера, в целях
          рекламы, в целях защиты прав Общества и привлеченным лиц, в целях
          осуществления производственной деятельности. Конкретный набор сервисов
          определяется правилами сайта «A-JOB.RU», публичными офертами,
          соглашениями, размещенными на сайте. Персональные данные, не
          соответствующие целям обработки, и/или избыточные, обработке не
          подлежат. Неполные/неточные персональные данные подлежат уточнению
          и/или удалению. Биометрические персональные данные не обрабатываются.
          Трансграничная передача данных не осуществляется.
        </p>

        <p className={styles.paragraph}>
          В указанных в настоящем пункте целях, размещая свои персональные
          данные при формировании личного кабинета (регистрации) и/или создании
          вакансии/резюме и/или использовании иных сервисов/материалов сайта
          «A-JOB.RU», пользователь дает свое безусловное согласие ООО
          «Экосистема Альфа», а также привлеченным им лицам, на обработку
          размещенных персональных данных, то есть на совершение действий,
          предусмотренных пунктом 3 статьи 3 ФЗ РФ от 27.07.2006г. № 152-ФЗ «О
          персональных данных». Указанное согласие действует бессрочно, до
          отзыва его пользователем через личный кабинет пользователя или через
          службу поддержки сайта «A-JOB.RU» путем подачи соответствующего
          обращения.
        </p>

        <p className={styles.paragraph}>
          Регистрируясь на сайте «A-JOB.RU», пользователь дает согласие на
          получение рассылок сайта «A-JOB.RU» информационного и рекламного
          характера.
        </p>

        <p className={styles.paragraph}>
          7. Если иное не предусмотрено законодательством о персональных данных
          с согласия субъекта персональных данных Общество может предоставлять и
          (или) поручать обработку персональных данных другому лицу, которое
          обязывается соблюдать конфиденциальность персональных данных и
          обеспечивать безопасность при их обработке.
        </p>

        <p className={styles.paragraph}>
          8. Сроки обработки персональных данных определяются в соответствии с
          целями, для которых они были собраны.
        </p>

        <p className={styles.paragraph}>
          9. Субъект персональных данных имеет право (если иное не предусмотрено
          законом) требовать уточнения своих персональных данных, их
          блокирования или уничтожения в случае, если персональные данные
          являются неполными, устаревшими, недостоверными, незаконно полученными
          или не являются необходимыми для заявленной цели обработки, а также
          принимать предусмотренные законом меры по защите своих прав; требовать
          перечень своих персональных данных, обрабатываемых Обществом, и
          источник их получения; получать информацию о сроках обработки своих
          персональных данных, в том числе о сроках их хранения; требовать
          извещения всех лиц, которым ранее были сообщены неверные или неполные
          его персональные данные, обо всех произведённых в них исключениях,
          исправлениях или дополнениях; обжаловать в уполномоченном органе по
          защите прав субъектов персональных данных или в судебном порядке
          неправомерные действия или бездействия при обработке его персональных
          данных; на защиту своих прав и законных интересов, в том числе на
          возмещение убытков и (или) компенсацию морального вреда в судебном
          порядке. Указанные права пользователь реализует путем направления
          соответствующего обращения через личный кабинет или через службу
          поддержки сайта «A-JOB.RU». При заявлении требования пользователя о
          блокировании персональных данных последние могут быть как блокированы,
          так и уничтожены.
        </p>

        <p className={styles.paragraph}>
          10. Ответственность Общества регламентируется действующим
          законодательством. Общество предпринимает все необходимые и
          достаточные правовые, организационные и технические меры в целях
          недопущения нарушения прав субъектов персональных данных. Однако
          Общество не несет ответственности за такие нарушения, произошедшие в
          результате технических сбоев, а также в результате действий третьих
          лиц, противоречащих действующему законодательству, условиям оферт,
          соглашений сайта «A-JOB.RU» (противоправные действия).
        </p>

        <p className={styles.paragraph}>
          11. Настоящая политика сайта «A-JOB.RU» является обязательными для
          каждого пользователя сайта «A-JOB.RU», составляют неотъемлемую часть
          любых оферт, cоглашений, предлагаемых к акцепту посредством сайта
          «A-JOB.RU», и любых договоров на использование сервисов сайта и
          распространяют свое действие на правоотношения с каждым пользователем
          сайта «A-JOB.RU» с момента его регистрации на сайте.
        </p>

        <p className={styles.paragraph}>
          12. Настоящая политика сайта «A-JOB.RU» является самостоятельной
          офертой на использование сайта, в том числе материалов сайта/сервисов
          сайта, для лиц, ограничивших использование сайта созданием личного
          кабинета, иной формой регистрации на сайте или иной формой
          использования сайта.
        </p>

        <p className={styles.paragraph}>
          13. Регистрация на сайте «A-JOB.RU» и/или создание личного кабинета, а
          также любое иное использование контента сайта «A-JOB.RU», в том числе
          материалов/сервисов сайта «A-JOB.RU», является акцептом условий любого
          использования/обработки персональных данных ООО «Экосистема Альфа».
        </p>

        <p className={styles.paragraph}>
          14. При регистрации на сайте «A-JOB.RU» и/или создании личного
          кабинета пользователю присваиваются уникальные логин (адрес
          электронной почты или телефон, указываемые пользователем) и пароль
          (формируется пользователем с использованием программных средств сайта
          «A-JOB.RU»). Сочетание логина и пароля формируют ключ простой
          электронной подписи. Использования ключа простой электронной подписи
          подтверждает факт формирования электронной подписи конкретным
          пользователем. Сохранность ключа простой электронной подписи
          обеспечивается пользователем. Риск неблагоприятных последствий от
          утери или иного несанкционированного пользователем распространения
          ключа простой электронной подписи и/или его составных элементов,
          включая гражданско-правовую ответственность, возлагается на
          пользователя. При регистрации на сайте «A-JOB.RU» и/или создании
          личного кабинета пользователю присваиваются уникальные логин (адрес
          электронной почты или телефон, указываемые пользователем) и пароль
          (формируется пользователем с использованием программных средств сайта
          «A-JOB.RU»). Сочетание логина и пароля формируют ключ простой
          электронной подписи. Использования ключа простой электронной подписи
          подтверждает факт формирования электронной подписи конкретным
          пользователем. Сохранность ключа простой электронной подписи
          обеспечивается пользователем. Риск неблагоприятных последствий от
          утери или иного несанкционированного пользователем распространения
          ключа простой электронной подписи и/или его составных элементов,
          включая гражданско-правовую ответственность, возлагается на
          пользователя. Применяемая пользователем в рамках сайта «A-JOB.RU»
          простая электронная подпись является равнозначной собственноручной
          подписи данного пользователя. Электронные документы, формируемые
          пользователем на сайте «A-JOB.RU», признаются равнозначными
          документам, подписанным собственноручной подписью пользователя.
          Пользователь вправе изменять логин и пароль. При изменении
          пользователем логина и/или пароля ключ простой электронной подписи
          считается измененным пользователем и применяется в измененном виде.
          Передача ключа простой электронной подписи (логина и/или пароля)
          неуполномоченным пользователем лицам запрещена. Все действия,
          совершенные под логином и паролем пользователя, рассматриваются как
          действия пользователя. Проверка подлинности простой электронной
          подписи, которой подписано обращение или электронный документ,
          производится программными средствами сайта «A-JOB.RU».
        </p>

        <p className={styles.paragraph}>
          В случае утери логина/пароля или наступления иных неблагоприятных
          последствий, нарушающих права владельца простой электронной подписи,
          пароль аннулируется администрацией сайта «A-JOB.RU» по обращению
          пользователя, не позднее следующего рабочего дня.
        </p>

        <p className={styles.paragraph}>
          С момента акцепта настоящей политики путем совершения пользователем
          регистрации на сайте соглашение об использовании простой электронной
          подписи на условиях настоящего пункта является заключенным.
        </p>
      </section>
    </div>
  );
};

export default PrivacyPolicy;
